OdDbBaseDatabasePE.getObscuredLtype(OdRxObject*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a value of the obscured linetype.
Such linetype is designed for output of obscured lines in hidden views.
An obscured line is a hidden line made visible by changing its color and linetype.
Obscured linetype != 0 indicates that hidden lines should be drawn using linetype and color overrides as follows.
Linetypes:
0. Off
1. Solid ______________________________________________
2. Dashed __  __  __  __  __  __  __  __  __  __  __  __
3. Dotted .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .
4. Short Dash __    __    __    __    __    __    __    __
5. Medium Dash ___   ___   ___   ___   ___   ___   ___   ___
6. Long Dash ____  ____  ____  ____  ____  ____  ____  ____
7. Double Short Dash ___        ___        ___        ___        ___
8. Double Medium Dash ______    ______    ______    ______    ______
9. Double Long Dash _________   _________   _________   _________
10. Medium Long Dash ____   ____   ____   ____   ____   ____   ____
11. Sparse Dot .     .     .     .     .     .     .     .     .
Default value is 0 (off).
Colors:
0       Color is set ByBlock.
256     Color is set ByLayer.
257     Color is set ByEntity (or by object).
1-255   Color is based on ACI.
Default value is 257.
\param pDb   [in] A reference to a database object.
\param color [out] A color to override in obscured lines traits.
\returns
Obscured linetype value.

OdDbBaseDatabasePE.createFilteredGiContextForExport(OdRxObject*,OdRxObjectPtr!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a Gi context object for a specified database to export entities from selection set only.
\param pDb   [in] A pointer to a database to create a context object for.
\param pSSet [in] A pointer to a selection set

OdDbBaseDatabasePE.getGeoData(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdGsDevice!System.Runtime.CompilerServices.IsConst*,OdGsView!System.Runtime.CompilerServices.IsConst*)
\details
Returns GeoData if it is available
\param pDb      [in] A pointer to a database object.
\param pView    [in] A pointer to a view, which displays GeoSpatial information
\params pDevice [in] A pointer to a device to render GeoSpatial information

OdDbBaseDatabasePE.getDatabasePartialViewingMode(OdRxObject*)
\details
Returns database Partial Viewing Mode

OdDbBaseDatabasePE.faceConversionHelper(OdDbStub**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject*,OdRxObject*,OdGiMaterialTraits!System.Runtime.CompilerServices.IsConst*,OdGiMapper!System.Runtime.CompilerServices.IsConst*,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*)
\details
For internal usage only.

OdDbBaseDatabasePE.removeDatabaseUnloadReactor(OdRxObject*,OdRxObject*)
\details
Removes a database unload reactor from a specified database.
This method should be reimplemented to provide a custom reaction for a database unload event.
\param pDb      [in] A pointer to a database object.
\param pReactor [in] A pointer to a reactor object to be removed.

OdDbBaseDatabasePE.addDatabaseUnloadReactor(OdRxObject*,OdRxObject*,OdDbBaseDatabasePE.DatabaseUnloadReactor*)
\details
Adds a new database unload reactor object to a specified database.
\param pDb              [in] A pointer to a database object.
\param pPrevReactor     [in] A pointer to a previous reactor object. If equal to NULL, then it is a new reactor.
\param pReactorRedirect [in] A pointer to a database object.
\remarks
There can be more than one database unload reactor. When a database unload event occurs, reactors run according to the order they have been added.

OdDbBaseDatabasePE.getCurrentLongTransation(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns an identifier of the current long transaction in a specified database.
\param pId [in]  A pointer to a database.

OdDbBaseDatabasePE.openObject(OdDbStub*)
\details
Returns a smart pointer to the object determined with its identifier.
\param pId [in]  A pointer to an object's identifier.

OdDbBaseDatabasePE.isAProxy(OdRxObject*)
\details
Determines whether a specified object is a proxy object.
\returns Returns true if the object is a proxy one, otherwise returns false.

OdDbBaseDatabasePE.setMultiThreadedRender(OdRxObject*,System.Boolean)
\details
Switches multi-threaded rendering on or off for a specified database.
\param db   [in]  A pointer to a database.
\param bOn  [in]  A value to be set (true if you want to switch multi-threaded rendering on or false in the other case).

OdDbBaseDatabasePE.xrefBlockId(OdRxObject*)
\details
Returns the identifier of the XRef block for a specified database.
\param db [in]  A pointer to a database.

OdDbBaseDatabasePE.currentLayoutId(OdRxObject*)
\details
Returns the identifier of the current layout for a specified database.
\param db [in]  A pointer to a database.

OdDbBaseDatabasePE.getPaperBlockId(OdRxObject*)
\details
Returns the identifier of the paper space block for a specified database.
\param db [in]  A pointer to a database.

OdDbBaseDatabasePE.getModelBlockId(OdRxObject*)
\details
Returns the identifier of the model space block for a specified database.
\param db [in]  A pointer to a database.

OdDbBaseDatabasePE.getCodePage(OdRxObject*)
\details
Returns the code page identifier for a specified database.
\param db [in]  A pointer to a database.

OdDbBaseDatabasePE.getOwner(OdDbStub*)
\details
Returns an identifier of an owner object for a specified database object.
\param id [in]  A database object identifier.

OdDbBaseDatabasePE.getDatabase(OdDbStub*)
\details
Returns a pointer to a database that a specified object belongs to.
\param id [in]  A database object identifier.

OdDbBaseDatabasePE.getHandle(OdDbStub*)
\details
Returns a handle of an object using its identifier.
\param id [in]  A database object identifier.

OdDbBaseDatabasePE.getObject(OdRxObject*,System.UInt64)
\details
Returns an identifier of a specified database object using its 64-bit handle.
\param db       [in]  A pointer to a database.
\param handle [in]  A database object handle.

OdDbBaseDatabasePE.getId(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns an object's identifier.
\param obj [in]  A pointer to an object in a database.

OdDbBaseDatabasePE.getTextStyleById(OdRxObject*,OdDbStub*,OdGiTextStyle*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Searches for a text style object by its identifier in the specified database.
\param db       [in]  A pointer to a database.
\param pLTypeId [in]  A text style identifier to be searched for.
\param LType    [out] A reference to an OdGiTextStyle object to store found text style information.
\returns Returns true if the text style object was found with the specified identifier, otherwise returns false.

OdDbBaseDatabasePE.getLineTypeById(OdRxObject*,OdDbStub*,OdGiLinetype*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Searches for a linetype object by its identifier in the specified database.
\param db       [in]  A pointer to a database.
\param pLTypeId [in]  A linetype identifier to be searched for.
\param LType    [out] A reference to an OdGiLinetype object to store found linetype information.
\returns Returns true if the linetype object was found with the specified identifier, otherwise returns false.

OdDbBaseDatabasePE.getMeasurement(OdRxObject*)
\details
Returns the measurement system that is used for linetypes and hatches for the specified database.
\param db   [in] A pointer to a database.
\remarks
See OdDb::MeasurementValue enumeration for additional information about valid measurement values.

OdDbBaseDatabasePE.baseFormatter(OdRxObject*)
\details
Returns the current units formatter for the specified database.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getUnits(OdRxObject*)
\details
Returns the drawing units that are used for automatic scaling of blocks, xrefs and images that are inserted into or attached to the specified database.
\param db   [in] A pointer to a database.
\remarks
See OdDb::UnitsValue enumeration for additional information about units.

OdDbBaseDatabasePE.getVersionGuid(OdRxObject*)
\details
Returns the specified database's version GUID.
The version GUID uniquely identifies the database version. It is updated each time database changes are saved.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getFingerPrintGuid(OdRxObject*)
\details
Returns the specified database's fingerprint GUID.
The fingerprint GUID uniquely identifies the database. It is created when the database is created.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getUpdateTime(OdRxObject*)
\details
Returns the specified database's last update date and time.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getCreationTime(OdRxObject*)
\details
Returns the specified database's creation date and time.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getFirstLayoutId(OdRxObject*)
\details
Returns an identifier of a layout related to model space of the specified database.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.getFirstLayout(OdRxObject*)
\details
Returns a layout that is related to model space of the specified database.
\param db   [in] A pointer to a database.

OdDbBaseDatabasePE.findLayoutNamed(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a pointer to an identifier of a layout with a specified name from the specified database.
\param db   [in] A pointer to a database.
\param name [in] A name of a layout.
\remarks
If a layout with the specified name is not found, a NULL pointer is returned.

OdDbBaseDatabasePE.findLayoutIdByViewport(OdRxObject*,OdDbStub*)
\details
Returns a pointer to an identifier of a layout related to a specified viewport from the specified database.
\param db           [in] A pointer to a database.
\param pViewportId  [in] A viewport identifier.
\remarks
If a layout related to the specified viewport is not found, a NULL pointer is returned.

OdDbBaseDatabasePE.findLayoutByViewport(OdRxObject*,OdDbStub*)
\details
Returns a layout related with a specified viewport from the specified database.
\param db           [in] A pointer to a database.
\param pViewportId  [in] A viewport identifier.
\remarks
If a layout with the specified viewport is not found, a NULL pointer is returned.

OdDbBaseDatabasePE.getLayout(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a layout with a specified name from the specified database.
\param pDb    [in] A pointer to a database.
\param name   [in] A name of a layout to be retrieved.
\remarks
If layout with the specified name is not found, NULL pointer is returned.

OdDbBaseDatabasePE.layouts(OdRxObject*)
\details
Returns layouts for the specified database.
\param db   [in] A pointer to a database.
\returns Returns an iterator for accessing the layout objects dictionary.

OdDbBaseDatabasePE.setCurrentLayoutId(OdRxObject*,OdDbStub*)
\details
Sets the current layout for the specified database.
\param db   [in] A pointer to a database.
\param id   [in] A ID of a layout to be set as current.

OdDbBaseDatabasePE.setCurrentLayout(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the current layout for the specified database.
\param db   [in] A pointer to a database.
\param name [in] A name of a layout to be set as current.

OdDbBaseDatabasePE.currentLayout(OdRxObject*)
\details
Returns the current layout for the specified database.
\param pDb [in] A pointer to a database.
\remarks
In this case the term "layout" means an abstraction that corresponds to a "sheet" in a sheet set manager, "page" in a .pdf or .dwf file, and "layout"+"block table record" in a .dwg file.

OdDbBaseDatabasePE.getVisualStyleId(OdRxObject*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns an object identifier of a visual style with a specified name from a specified database.
\param db   [in] A pointer to a database, from which the visual style data will be retrieved.
\param name [in] A visual style name.
\returns Returns the visual style object identifier if it was found or OdDbObjectId::kNull value in the other case.

OdDbBaseDatabasePE.visualStyles(OdRxObject*)
\details
Returns a smart pointer to the iterator of the specified database's visual styles.
\param db [in] A pointer to a drawing database, from which the method retrieves information about visual styles.

OdDbBaseDatabasePE.loadXrefs(OdRxObject*)
\details
Loads referenced databases
\param db           [in]     A pointer to a drawing database.

OdDbBaseDatabasePE.layers(OdRxObject*,OdGiContext*)
\details
Returns a smart pointer to the iterator of the specified database's layers for layer context-dependent databases.
\param db [in] A pointer to a drawing database, from which the method retrieves information about layers.
\param pContext [in] A pointer to a Gi context, from which the method retrieves information about layers.
\returns Smart pointer to iterate through found layers.

OdDbBaseDatabasePE.layers(OdRxObject*)
\details
Returns a smart pointer to the iterator of the specified database's layers.
\param db [in] A pointer to a drawing database, from which the method retrieves information about layers.

OdDbBaseDatabasePE.isContextDependentLayers(OdRxObject*)
\details
Checks whether layer properties (visibility, color, line type, line weight) depend on current Gi context.
\param db [in] A pointer to a drawing database from which the method retrieves information about layers.
\returns True if layer properties depend on current Gi context, false otherwise.

OdDbBaseDatabasePE.loadPlotstyleTableForActiveLayout(OdGiDefaultContext*,OdRxObject*)
\details
Loads plot styles of the active layout to a specified Gi context object.
\param pDwgContext [in] A pointer to a Gi context object. Plot styles will be loaded into it.
\param db          [in] A pointer to a drawing database.

OdDbBaseDatabasePE.zoomToExtents(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDevice*,OdRxObject*,OdGeBoundBlock3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong,OdDbStub*)
\details
Makes the specified Gs device render the current layout zoomed to extents.
\param outputRect   [in]     A rectangle, which determines the printable area in device units.
\param pDevice      [in]     A pointer to a device to render the current layout with.
\param db           [in]     A pointer to a drawing database.
\param plotExtents  [in/out] Eye coordinate system plotting extents of the device viewport.
\param extentsFlags [in]     Extents flags.
\param objectId     [in]     Object identifier.
\remarks
If no viewport is found, the method throws an exception.
plotExtents will be used to zoomExtents if kUseGivenExtents flag is set, otherwise they will be calculated

OdDbBaseDatabasePE.applyLayoutSettings(OdGsDCRect*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDevice*,OdRxObject*,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets current layout plot settings (such as paper size, rotation, scale, etc.) to a specified Gs device.
\param clipBox      [out] A visible rectangle to be returned.
\param pDevice      [in]  A pointer to a device to apply plot settings to.
\param db           [in]  A pointer to a drawing database.
\param extentsFlags [in]  Extents flags.
\param dpi          [in]  Resolution value.

OdDbBaseDatabasePE.getNextViewForActiveLayout(OdGiDefaultContext*,OdDbStub*)
\details
Gets the next view associated with the active layout.
\param pGiCtx [in] A pointer to a default Gi context object.
\remarks
This functionality currently is not implemented.

OdDbBaseDatabasePE.setupPalette(OdGsDevice*,OdGiDefaultContext*,OdDbStub*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets up a palette associated with a specified device layout.
\param device     [in] A pointer to a device.
\param giContext  [in] A pointer to a Gi context.
\param pGiCtx     [in] A pointer to a database layout identifier.
\param palBg      [in] A background color of the palette.
\remarks
To overwrite the default DB-palette color, use a non-zero value for the alpha component of RGBA color.

OdDbBaseDatabasePE.setupLayoutView(OdGsDevice*,OdGiDefaultContext*,OdDbStub*)
\details
Sets up Gs views for a specified device according to the specified database layout data.
\param pDevice  [in] A pointer to a device.
\param pGiCtx   [in] A pointer to a Gi context object with active layout data.
\param pGiCtx   [in] A pointer to a database layout identifier.
\returns A smart pointer to an OdGsDevice object with view set up.

OdDbBaseDatabasePE.setupActiveLayoutViews(OdGsDevice*,OdGiDefaultContext*)
\details
Sets up Gs views for a specified device, according to the active database layout data.
\param pDevice  [in] A pointer to the device.
\param pGiCtx   [in] A pointer to the Gi context object with active layout data.
\returns A smart pointer to an OdGsDevice object with views set up.

OdDbBaseDatabasePE.createTextIterator(OdRxObject*,System.UInt16!System.Runtime.CompilerServices.IsConst*,System.Int32,System.Boolean,OdGiTextStyle!System.Runtime.CompilerServices.IsConst*)
\details
Creates a TextIterator object for the specified data.
\param textString [in]  Text string to be parsed.
\param length     [in]  Length of string in bytes.
\param raw        [in]  If and only if true, character sequences in the form of %%c will be treated as raw text.
\param codePageId [in]  Object ID of the code page for the text.
\param pTextStyle [in]  Pointer to the TextStyle object associated with the specified text.
\returns
Returns a SmartPointer to the new OdDbTextIterator object.

OdDbBaseDatabasePE.putNamedViewInfo(OdRxObject*,OdDbStub*,OdArray&lt;OdString,OdObjectsAllocator&lt;OdString&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGsDevice!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves information about viewports for a specified database and layout.
\params pDb       [in]  A pointer to a database.
\params layoutId  [in]  A layout identifier.
\params names     [out] An array of viewport names. Filled and returned by the method.
\params points    [out] An array of viewport points. Filled and returned by the method.
\params pDevice   [in]  The device to find only the views, which device is able to render

OdDbBaseDatabasePE.createGiContext(OdRxObject*)
\details
Creates a Gi context object for a specified database.
\param pDb [in] A pointer to a database to create a context object for.

OdDbBaseDatabasePE.undo(OdRxObject*)
\details
Performs an undo operation on this database object.
\remarks
All operations performed since the last call to startUndoRecord will be undone.
At least 1 undo step is always supported for internal needs.

OdDbBaseDatabasePE.evaluateFields(OdRxObject*,System.Int32)
\details
Evaluates fields in database.
\param pDb [in]  Pointer to the database for which fields are to be evaluated
\param nContext [in]  Input context in which the field is evaluated, which can be a predefined *OdDbField::EvalContext* enum flag or a user-defined context flag; this context flag is passed to the evaluator

OdDbBaseDatabasePE.startUndoRecord(OdRxObject*)
\details
Starts undo recording of this database object.

OdDbBaseDatabasePE.abortTransaction(OdRxObject*)
\details
Aborts (rolls back) the current database transaction.
\param pDb [in] A pointer to a database where the transaction should be aborted.

OdDbBaseDatabasePE.startTransaction(OdRxObject*)
\details
Starts a database transaction.
\param pDb [in] A pointer to a database where the transaction should be started.

OdDbBaseDatabasePE.getFilename(OdRxObject*)
\details
Returns the name of the file associated with this database object.

OdDbBaseDatabasePE.appServices(OdRxObject*)
\details
Returns the OdDbBaseHostAppServices object associated with this database object.